/******************************************************************************
* @file    main.h 
* @author  Storozhenko Roman - D_EL
* @version V1.0
* @date    11-09-2015
* @brief   Обьявление глобальных переменных, макросы
******************************************************************************/
#ifndef MAIN_H
#define MAIN_H

/******************************************************************************
* User define
*/
#define VERSOFT_STR         "V3.000"
#define SYSTEM_FREQUENCY    24000000 //Hz

//===========================================================================
//Номер сектора для сохранения параметров
//===========================================================================
#define SETTING_SEC_CONF    31

/******************************************************************************
* Prototypes for the functions
*/
__noreturn main(void);

#endif  //MAIN_H
/****************** (C) COPYRIGHT ************** END OF FILE ****** D_EL *****/
